{
    "Lyrics": [
        [
            "[Verse 1: Ariana Grande]",
            "I'm a motherfuckin' train wreck",
            "I don't wanna be too much",
            "But I don't wanna miss your touch",
            "And you don't seem to give a fuck",
            "I don't wanna keep you waiting",
            "But I do just what I have to do",
            "And I might not be the one for you",
            "But you ain't allowed to have no boo",
            "",
            "[Pre-Chorus: Ariana Grande]",
            "'Cause I know we be so complicated",
            "But we be so smitten, it's crazy",
            "I can't have what I want, but neither can you",
            "",
            "[Chorus: Ariana Grande]",
            "You ain't my boyfriend (Boyfriend)",
            "And I ain't your girlfriend (Girlfriend)",
            "But you don't want me to see nobody else",
            "And I don't want you to see nobody",
            "But you ain't my boyfriend (Boyfriend)",
            "And I ain't your girlfriend (Girlfriend)",
            "But you don't want me to touch nobody else (Nobody)",
            "Baby, we ain't gotta tell nobody",
            "",
            "[Verse 2: Mikey]",
            "Even though you ain't mine, I promise the way we fight",
            "Make me honestly feel like we just in love",
            "'Cause, baby, when push comes to shove",
            "Damn, baby, I'm a train wreck, too (Too)",
            "I lose my mind when it comes to you",
            "I take time with the ones I choose",
            "And I don't want a smile if it ain't from you, yeah",
            "",
            "[Pre-Chorus: Mikey]",
            "I know we be so complicated",
            "Lovin' you sometimes drive me crazy",
            "'Cause I can't have what I want and neither can you",
            "",
            "[Chorus: Ariana Grande]",
            "You ain't my boyfriend (Boyfriend)",
            "And I ain't your girlfriend (Girlfriend)",
            "But you don't want me to see nobody else",
            "And I don't want you to see nobody",
            "But you ain't my boyfriend (Boyfriend)",
            "And I ain't your girlfriend (Girlfriend)",
            "But you don't want me to touch nobody else (Nobody)",
            "Baby, we ain't gotta tell nobody",
            "",
            "[Verse 3: Scootie & Ariana Grande]",
            "I wanna kiss you (Yeah), don't wanna miss you (Yeah)",
            "But I can't be with you 'cause I got issues",
            "Yeah, on the surface, seem like it's easy",
            "Careful with words, but it's still hard to read me",
            "Stress high when the trust low (Mmm)",
            "Bad vibes, where'd the fun go? (Oh)",
            "Try to open up and love more (Love more)",
            "Try to open up and love more",
            "",
            "[Bridge: Scootie, Ariana Grande, & Both]",
            "If you were my boyfriend",
            "And you were my girlfriend",
            "I prolly wouldn't see nobody else",
            "But I can't guarantee that by myself",
            "",
            "[Chorus: Ariana Grande]",
            "You ain't my boyfriend (Boyfriend, you ain't my boyfriend)",
            "And I ain't your girlfriend (Girlfriend, I ain't your girlfriend)",
            "But you don't want me to see nobody else (Nobody)",
            "And I don't want you to see nobody",
            "But you ain't my boyfriend (Boyfriend, you know you ain't my boyfriend)",
            "And I ain't your girlfriend (Girlfriend, yeah, mmm)",
            "But you don't want me to touch nobody else (Nobody)",
            "Baby, we ain't gotta tell nobody (Oh yeah)",
            "You ain't my boyfriend (Boyfriend)",
            "And I ain't your girlfriend (Girlfriend)",
            "But you don't want me to see nobody else",
            "And I don't want you to see nobody",
            "But you ain't my boyfriend (Boyfriend)",
            "And I ain't your girlfriend (Girlfriend, yeah)",
            "But you don't want me to touch nobody else (Nobody)",
            "Baby, we ain't gotta tell nobody"
        ]
    ],
    "Comments": [
        "“Boyfriend” is a single by the American singer Ariana Grande and duo Social House. Grande revealed the single’s title & release date on a teaser from Twitter.",
        "Social House helped produce many of Grande’s cuts such as from “goodnight n go” from her 2018 album Sweetener & two Billboard Hot 100 number-one singles, “thank u, next” and “7 rings” from her 2019 smash, thank u, next. Moreover, she provided back up vocals for the duo’s April 2019 single, “Haunt You.”",
        "Dutch Translation",
        "Farsi Translation",
        "French Translation",
        "Italian Translation",
        "Polish Translation",
        "Portuguese Translation",
        "Spanish Translation",
        "I feel like this song captures a common theme in the lives of so many people I know! People want to feel love but don’t want to define their relationship [and] have trouble fully committing or trusting or allowing themselves to fully love someone. Even [though] they want to.",
        "— Ariana via Twitter",
        "We wanted to make something uplifting that captures that feeling of being afraid to take the leap [and] trust, being afraid of being hurt or feeling like you won’t be enough for that person, but also how it feels to have a crippling crush on someone.",
        "— Ariana on another tweet",
        "Aside from being Ariana Grande’s opener for the entirety of her Sweetener World Tour, Social House has worked alongside Ari to produce “thank u, next,” “7 rings,” “MONOPOLY,” and “goodnight n go.” In addition to their work as a producer, Ariana lended her voice for Social House’s April 2019 single “Haunt You.” The duo talked about working with Ariana during an interview with Zach Sang:"
    ],
    "Title": "Ariana Grande & Social House – Boyfriend Lyrics | Genius Lyrics",
    "Release date": "August 2, 2019"
}