{
    "Lyrics": [
        [
            "He opens my ribs and drinks my soup",
            "With a personal kiss from my stomach",
            "I don't think I have any taste",
            "But if it makes Papa happy...",
            "",
            "Suck up my yellow fat with a straw",
            "Stick it into my pee-pee and suck it up like that too",
            "Fill it up with my poop and bake it",
            "Even though my body is collapsing for Papa's sake",
            "",
            "I'm sorry, after all, I don't have a good feeling",
            "A big brother I don't know told me, ahh",
            "Even though my collapsed body is pitiful, he kindly reaches out a hand",
            "",
            "I'm sorry, I'm sorry, I must be a bad girl",
            "So forgive me, forgive me, poor little me",
            "I'm sorry, goodbye, I'm a bad girl for running away from Papa",
            "I'm sorry, forgive me for falling in love with someone who's not Papa",
            "",
            "Big Brother gulps down my amniotic fluid",
            "He breaks open my hard stomach and touches the inside",
            "Without eating me, he treats me gently",
            "Even though my collapsed body is ugly",
            "",
            "I'm sorry, that's not a good feeling I have",
            "Big Brother must hate me, ahh",
            "My collapsed body gives a bad feeling",
            "It can be kept on file, and it's the end",
            "",
            "I'm sorry, I'm sorry, I must be a bad girl",
            "So forgive me, forgive me, lonely little me",
            "I'm sorry, goodbye, I'm a bad girl for returning to Papa",
            "I'm sorry, forgive me for not being able to love my cruel Papa",
            "",
            "When he came home, Papa was with a lot of people",
            "They said they had believed I'd return",
            "They want to eat my collapsed body until the end",
            "That's what they said",
            "",
            "I'm sorry, I'm sorry, I must be a bad girl",
            "So forgive me, forgive me, poor little me",
            "I'm sorry, is it tasty? That's the taste of a warm heart",
            "I'm sorry, even though it hurts, my heart is satisfied",
            "",
            "I'm sorry, I'm sorry, I must be a bad girl",
            "So forgive me, forgive me, lonely little me",
            "I'm sorry, even though it hurts, as long as you eat me and it tastes good",
            "I'm happy, goodbye, everybody eat up except for my heart"
        ]
    ],
    "Comments": [
        [
            "“Gomenne, Gomenne” is part of Kikuo-p’s Kikuo Miku 2 album also featuring IA and Tone Rion. Kikuo uses his signature pop-techno style with an aggressive anti-chorus breakdown and some other organic elements.",
            "As recurrent of Kikuo, the song while poppy and light-hearted sounding absolutely graphic and borderline scarring: depicting grotesque scenes of cannibalism all at the hands of men anonymously known as “daddy” or “nii-san”.",
            "The song is generally interpreted by fans of the community as a song about a girl going through abuse from her father. Because the physical trauma of this song is too much for a person to bear and is too macabre for a person to be left alive, some interpretations points to rape. Her trauma perverts her interpretation of sex from persons who love her and perverts healthy relationships that she has with other people; in the end she only finds real love in her father, the master of her suffering."
        ]
    ],
    "Title": "Kikuo-p – I'm Sorry, I'm Sorry Lyrics | Genius Lyrics",
    "Release date": "August 11, 2012"
}