{
    "Lyrics": [
        [
            "[Verse 1]",
            "Took a trip to San Francisco",
            "All  our friends said we would jive",
            "Didn't  work, so I left for Fresno",
            "It was quite a scenic drive",
            "Pulled over to watch the children in the park",
            "We  used to only worry for them after dark",
            "",
            "[Chorus]",
            "I’m  still looking for my own version of America",
            "One without the gun, where the flag can freely fly",
            "No  bombs in the sky, only fireworks when you and I collide",
            "It's just a dream I had in mind",
            "It's just a dream I had in mind",
            "It’s just a dream I had in mind",
            "",
            "[Verse 2]",
            "I  flew back to New York City",
            "Missed that Hudson River line",
            "Took a train up to Lake Placid",
            "That's another place and time, where",
            "I used to go to drive-ins and listen to the blues",
            "So many things that I think twice about before I do, no",
            "",
            "[Chorus]",
            "I'm still looking for my own version of America",
            "One without the gun, where the flag can freely fly",
            "No bombs in the sky, only fireworks when you and I collide",
            "It's just a dream I had in mind",
            "It's just a dream I had in mind",
            "It's just a dream I had in mind",
            "It's just a dream I had in mind"
        ]
    ],
    "Comments": [
        [
            "“Looking for America” is a song Lana wrote on August 5th, 2019 regarding the mass shootings throughout the US, once she got back to L.A. The message of the song relies upon Lana dreaming of a better situation for American people, a topic she has sung before in tracks like “Coachella – Woodstock in My Mind” and “When The World Was at War We Kept Dancing”. Del Rey released the song via streaming platforms on August 9th, 2019 as a single.",
            "The title of the song might be a reference to “America” by Simon & Garfunkel:",
            "They’ve all come to look for America",
            "Del Rey took her Instagram to share a video of her singing in the studio with friend and producer Jack Antonoff."
        ],
        [
            "Del Rey shared the song via Instagram adding:",
            "Hi folks came back early from Montecito with my brother this morning and asked Jack Antonoff to come into town because I had a song on my mind that I wanted to write. Now I know I’m not a politician and I’m not trying to be so excuse me for having an opinion- but in light of all of the mass shootings and the back to back shootings in the last couple of days which really affected me on a cellular level I just wanted to post this video that our engineer Laura took 20 minutes ago. I hope you like it. I’m singing love to the choruses I recorded this morning. I’m going to call it ‘Looking for America‘."
        ]
    ],
    "Title": "Lana Del Rey – Looking For America Lyrics | Genius Lyrics",
    "Release date": "August 9, 2019"
}