{
    "Lyrics": [
        [
            "[Intro]",
            "Is this the real life? Is this just fantasy?",
            "Caught in a landslide, no escape from reality",
            "Open your eyes, look up to the skies and see",
            "I'm just a poor boy, I need no sympathy",
            "Because I'm easy come, easy go, little high, little low",
            "Any way the wind blows doesn't really matter to me, to me",
            "",
            "[Verse 1]",
            "Mama, just killed a man",
            "Put a gun against his head, pulled my trigger, now he's dead",
            "Mama, life had just begun",
            "But now I've gone and thrown it all away",
            "Mama, ooh, didn't mean to make you cry",
            "If I'm not back again this time tomorrow",
            "Carry on, carry on as if nothing really matters",
            "",
            "[Verse 2]",
            "Too late, my time has come",
            "Sends shivers down my spine, body's aching all the time",
            "Goodbye, everybody, I've got to go",
            "Gotta leave you all behind and face the truth",
            "Mama, ooh (Anyway the wind blows)",
            "I don't wanna die",
            "I sometimes wish I'd never been born at all",
            "",
            "[Verse 3]",
            "I see a little silhouetto of a man",
            "Scaramouche, Scaramouche, will you do the Fandango?",
            "Thunderbolt and lightning, very, very frightening me",
            "(Galileo) Galileo, (Galileo) Galileo, Galileo Figaro magnifico",
            "But I'm just a poor boy, nobody loves me",
            "He's just a poor boy from a poor family",
            "Spare him his life from this monstrosity",
            "Easy come, easy go, will you let me go?",
            "Bismillah! No, we will not let you go",
            "(Let him go!) Bismillah! We will not let you go",
            "(Let him go!) Bismillah! We will not let you go",
            "(Let me go) Will not let you go",
            "(Let me go) Will not let you go",
            "(Let me go) Ah",
            "No, no, no, no, no, no, no",
            "(Oh, mamma mia, mamma mia) Mamma mia, let me go",
            "Beelzebub has a devil put aside for me, for me, for me!",
            "",
            "[Verse 4]",
            "So you think you can stone me and spit in my eye?",
            "So you think you can love me and leave me to die?",
            "Oh, baby, can't do this to me, baby!",
            "Just gotta get out, just gotta get right outta here!",
            "",
            "[Outro]",
            "Nothing really matters, anyone can see",
            "Nothing really matters",
            "Nothing really matters to me",
            "Any way the wind blows"
        ]
    ],
    "Comments": [
        [
            "Widely considered to be one of the greatest songs of all time, “Bohemian Rhapsody” was the first single released from Queen’s fourth studio album, A Night at the Opera. It became an international success, reaching #1 in five countries and peaking at #9 in the United States. Seventeen years after its initial release, “Bohemian Rhapsody” re-entered the pop charts in the US, peaking at #2 after being featured in the 1992 hit movie Wayne’s World. In 2002, the song was listed at #1 in a Guinness World Records poll as Britain’s favourite single of all time—ranking higher than four Beatles tracks and “Imagine” by John Lennon.",
            "Complex and operatic both musically and lyrically, “Bohemian Rhapsody” (like Led Zeppelin’s “Stairway to Heaven” and The Eagles‘ “Hotel California”) has attracted endless fan theories and commentary. The surviving band members have claimed that the narrative is based on the Faust legend; critics have found possible sources in opera and Freddie Mercury’s personal biography; but like any good piece of art, it’s open to interpretation.",
            "The word “Bohemian” seems to refer to a group of artists and musicians from the 19th century, known for defying convention and living with disregard for standards; as opposed to the region of Bohemia in the Czech Republic. Meanwhile the term “rhapsody” (derived from the Greek: ῥαψῳδός or rhapsōidos for a reciter of epic poetry, or a rhapsodist) is a piece of classical music with distinct sections that are played as one movement. Rhapsodies often feature dense themes or narratives.",
            "As of December 2018, Bohemian Rhapsody is the most streamed song of the 20th century."
        ],
        [
            "A “bohemian” is an unconventional artistic free spirit who lacks anything tying them down. It can also refer to the Kingdom of Bohemia, now part of Czechia. It became associated with that sort of lifestyle because the French thought that was where travelling Romani communities came from."
        ],
        [
            "“Objection, your Honor: context!” Re-phrase:",
            "In late 1975, when Bo Rap’s thunderbolts and lightning cast Queen as rock-gods, was Mercury struck as very, very openly gay?",
            "To “be gay”, or “not to be gay”, in mid-1970’s England, was that a question of psychiatric, legal, and/or religious ramifications?  Mamma mia; “Spare him his life from” such monstrosities\", eh?",
            "Bo-Rap is a thrill ride shape-shifter, from tragic tear-jerk-trigger-pulling proportions to the comedically scary mock-opera trial parts.  It took “Wayne’s World” to push on the gas of the thrill ride back up the U.S. charts to not-quite-#1.  Before the snooty over-analysis to follow, let’s get one thing straight: this song has plenty of Bohemian comedy, so line up your opera spectacles (is “opera” gay?).   And let’s not forget the B-side: Roger’s “I’m in Love With My Car”.  Was he, then, motorosexual?  Metrosexual?  It’s all dripping in the metaphorical.  Words, words, words, must be carefully chosen: ask Oscar Wilde or anyone accused of being heretical by the Papacy (scarier than reigning Queens, like certain … nevermind).",
            "Was Galileo imprisoned for his heliocentrism?  Galileo Galilei was a Sheer Heretic, no? And if Dr. Brian May played the role of the 17th Century Astronomer, then who is Figaro, and were THEY straight?  Was the earth flat?  “Objection, your Honor!”",
            "Sustained; irreverent.  Scaramouche, re-direct the “gay connotations” rotation annotation to the 20th to 21st century.  Proceed:",
            "Many folks interpret Bo Rap’s lyrics as Mercury’s metaphoric struggle with his sexuality; Brian May and Roger Taylor have hinted at the viability of this “rap” regarding Freddie’s Bohemia.",
            "Mercury let these lyrics “be” open to interpretation.  The song was a seedling as “The Cowboy Song”.   That theme bit the dust ahead of time, but apparently left a smoking gun, anyway the wind blew pipes into Queen’s three singing members in mock-opera splendor, the antithesis of a “mute” court.  Or was it an operatic jury from Hell passing judgment on the “love” that dare not speak its name?",
            "Freddie did say the song was about “relationships”; everyone can relate to that, regardless of “sexual preferences”.",
            "Sheila Whiteley co-authored a 2006 “book” of 19 essays about sexuality in popular music, “Queering the Popular Pitch” (Eds. Sheila Whiteley and Jennifer Rycenga, published by Routledge).  Whiteley’s essay “Popular Music and the Dynamics of Desire” on page 252 provides an informative summary, albeit with a lyrical stretch,",
            "The heightened sense of urgency seems to resonate with Mercury’s inner turmoil, leaving the security of Mary Austin (who …remained",
            "a close friend throughout his life) coming to terms with gay life (“Easy come, easy go”), and living with a man (“So you think you can stone me and spit in my eye”). Mary was, however, more perceptive than the song implies. At the time, Freddie had asked her if she thought he was bisexual. Her reply—“I don’t think you’re bisexual. I think you’re gay” provides an insight into their relationship and her continuing support.",
            "When Queen’s gravitational pull grounded their megastardom around the globe, Freddie was not openly gay, i.e., he was not “out-of-the-closet” in a public way.  An openly gay rock star, especially in the United States, would have been the kiss-of-death if the fate of New York City’s glam-rock overtly gay artist Jobriath gives any clue.",
            "Mary Austin was Freddie’s dearest friend and family-member, by default and design.  His death is literally a testament to this.  The Vintage News notes:",
            "Freddie Mercury’s will dictated that Mary was left with the better part of his wealth, more than $10 million, as well as his large mansion. His mother reportedly approved his decision, stating that Mary was like a family to her.",
            "Queen’s monetary health (especially Freddie’s) began with the success of Bo-Rap and their fourth album, “A Night at the Opera”.   Such artistic and commercial acclaim made all of Queen’s men quite merry and GAY, and not merely because of the ensuing fame and pay, nor from relief at having severed the strings from their prior managers' greed, who allegedly swindled the band, so badly it spawned Mercury’s wrath on “A Night at the Opera”’s opening track, “Death on Two Legs (Dedicated to…)”.",
            "This success a confirmed the viability of their music, a guarantee to continue their careers as passionate musicians and hard workers that rocked devotedly to their following, their fans, on their own (often lavish) terms.",
            "Was Freddie Mercury “gay”?  Or was he “bi-sexual”?  Did his “personal inclinations” have a creative impact on Queen’s music and performances for better or for worse?  “Objection your honor!” Sustained.  Queen rules; Freddie sang his heart out for his fans, as much as he physically could, until the day he died."
        ],
        [
            "Portuguese Translation",
            "Spanish Translation"
        ],
        [
            "The most sensible literal reading of the song is that the narrator confesses to a murder, is put on trial, and either escapes or gets executed. Figurative readings—like interpretations that it is an allegory for Freddie’s struggles with his sexuality—are also possible, but harder to support."
        ],
        [
            "There is nothing connecting any of the characters in the song to Freddie’s bandmates. Indeed, he started writing the song before he met them. Some argue that “Mamma” is Mary Austin, Freddie’s long-term partner. A year after the release of “Bohemian Rhapsody”, Freddie confessed to her that he was bisexual and their relationship ended."
        ],
        [
            "No, as of 2018, there are three surviving original members."
        ],
        [
            "According to officialcharts.com:",
            "‘Bohemian Rhapsody’ is responsible for the modern music video. The video for the track was recorded on November 10, 1975. It took just four hours to film and another five to edit, at a total cost of £4,500. It was aired on Top Of The Pops for the first time on November 20 of that year. When other artists and record labels saw how effective a promotional video could be, they all climbed on the bandwagon—the music industry has never been the same since!",
            "As for the visual effects, the Music Video Wikia page for “Bohemian Rhapsody” describes them as such:",
            "The video opens with a shot of the four band members in near darkness as they sing the a cappella part. The lights fade up, and the shots cross-fade into close-ups of Freddie. All of the special effects were achieved during the recording. The effect of the face zooming away was accomplished by pointing the camera at a monitor, giving visual feedback, a visual glare, analogous to audio feedback. The honeycomb effect was achieved by using a shaped lens."
        ],
        [
            "Read the annotation!"
        ],
        [
            "Lead singer Freddie Mercury died of AIDS in 1991. Following this, bassist John Deacon left the industry. As of 2018, guitarist Brian May and drummer Roger Taylor still tour together as Queen."
        ],
        [
            "Yes"
        ]
    ],
    "Title": "Queen – Bohemian Rhapsody Lyrics | Genius Lyrics",
    "Release date": "October 31, 1975"
}