{
    "brand": "Lenovo",
    "name": "Lenovo 11.6-inch IPS Touchscreen 2-IN-1 Convertible Laptop PC, Intel Celeron Processor Up To 2.48GHz, 4GB RAM, 32GB SSD, Bluetooth, HDMI, WIFI, Spill-Resistant Keyboard, Windows 10 Pro",
    "price": "$252.99",
    "img-url": "https://images-na.ssl-images-amazon.com/images/I/51zDMp2AyRL._SY300_QL70_.jpg",
    "star-rating": "2.9 out of 5 stars",
    "cusomter-reviews-count": "19 customer reviews",
    "details": [
        "What's Covered: Drops; Liquid Damage; Other Accidents; Screen Failure; Electrical Failure;",
        "24/7 customer support",
        "Free shipping on all repairs with no deductibles or hidden fees",
        "Fully transferable with gifts. Cancel anytime, full refund in the first 30 days",
        "SquareTrade Protection Plans are only valid for new products purchased at Amazon within the last 30 days",
        "2-in-1-Convertible 360-degree Design, 11.6-inch touchscreen HD IPS Display (1366 x 768), Intel HD graphics 400",
        "Intel Celeron N3060 1.6GHz (Turbo Boost up to 2.48GHz, 2MB Cache), 4GB DDR3, 32GB eMMC Solid State Drive",
        "Built-In SD Card Reader, Stereo speakers, HD webcam with dual microphones, Water-Resistant Keyboard",
        "High speed 802.11ac Wi-Fi,Bluetooth 4.0, 1 x USB 3.0,2 x USB 2.0,1 x HDMI, 1x audio/mic jack",
        "Windows 10 Professional OS, Dimensions: 11.83\"L x 8.37\"W x 0.92\"H, Weight: 3.1 lbs. Color: Black"
    ],
    "short-reviews": [
        "Eh",
        "Lenovo N23 2-1 provides great features without fragility",
        "It was worth it!!",
        "Four Stars",
        "One Star",
        "Not worth your time.",
        "Simple to use and every bit well described.. ...",
        "Not what’s advertised"
    ],
    "long-reviews": [
        "I’m not in love with it, but I don’t hate it. Screen flexibility is great for streaming shows and for minor presentations/photos. Hard drive space sucks with Windows. I’m constantly nagged by Microsoft about minimal space for updates. I think I hate Windows on the pc more than the pc itself. An external hard drive helps, but only when the product is stationary. A micro SD drive is super helpful for being mobile. Keyboard reaction time is a bit slow at times, and not having a number keyboard is annoying. Touch screen is cool. No DVD drive can easily be remedied with an external one.",
        "I like the touchscreen, the easy but sturdy flipping, the keyboard touch, and the small size.  I've used Lenovo products before and keep coming back.",
        "I love this convertible laptop/tablet. So far, I haven't had any issues. This is my first 2-in-1 and I'm glad I bit the bullet and purchased it!!The battery life is great.",
        "Quality product, not enough memory",
        "Battery life is extremely poor. Not even enough space for windows updates. Do not BUY!",
        "Awesome physical structure. Really liked this laptop, then accepted the hard drive is almost entirely filled with files that cannot be removed or changed. Wouldn't buy if I knew this before purchasing.  I cleared about 5 gigs off hard drive. Windows had to update, back to 95 percent full. Computers run extremely slow when the hard drive is full, it's been this way since I took it out of the box. I understand for a computer this size,  a 32 gig hard drive is common. You can buy a microsd or usb, but then I am spending more money only to make this one work. I am exchanging this or donating. Then buying a different computer ASAP. Update: tried to uninstall one of the ten updates that couldn't install due to software and hard drive. Been stuck in loading mode 10-15 min, questioning if computer still functional.",
        "Simple to use and every bit well described...thank you!",
        "Pictures are not what shows up, it’s a completly different laptop. Returning immediately."
    ]
}