{
    "brand": "Dell",
    "name": "Dell Inspiron 13 5000 2-in-1 - 13.3\" FHD Touch - 8th Gen Intel i5-8250U - 8GB Memory - 256GB SSD - Intel UHD Graphics 620 - Theoretical Gray - i5379-5893GRY-PUS",
    "price": "$649.00",
    "img-url": "https://images-na.ssl-images-amazon.com/images/I/41Bqtfznc8L._SY300_QL70_.jpg",
    "star-rating": "3.4 out of 5 stars",
    "cusomter-reviews-count": "50 customer reviews",
    "details": [
        "8th Generation Intel Core i5-8250U Processor (6MB Cache, up to 3.4 GHz)",
        "8GB 2400MHz DDR4 up to [16GB], (additional memory sold separately)",
        "256 GB (SSD)",
        "13.3-inch FHD (1920 x 1080) IPS Truelife, LED-Backlit Touch Display with Wide Viewing Angles-IR Camera",
        "Be more productive. Windows 10 is the best for bringing ideas forward and getting things done"
    ],
    "short-reviews": [
        "Great Choice as a Linux User (and for Others)",
        "A good buy.",
        "Several power issues may exist with this product",
        "Great laptop for the price",
        "Excellent",
        "Very functional, but speaker location is a design flaw",
        "Surprised I like it so much!",
        "Excellent Value and Functionality"
    ],
    "long-reviews": [
        "Bought this laptop to run Manjaro KDE (Linux) and act as my primary \"everyday use\" computer at home. Ill break the review down into 2 parts. Ill start first with the hardware which should be helpful to anyone reading this and then the second part will specifically be about using Linux on it. Model is Dell i5379-5893GRY-PUS (Dell Inspiron 13\" 2-in-1 touchscreen)Hardware:The build quality is nice. Despite being a plastic shell (instead of metal like the Inspiron 7000) it feels of good quality to the point of questioning if it is plastic. The finish is nice and doesn't appear to attract finger prints as much as glossier finishes. Its a good balance of enough weight to not feel cheap but not too much that its \"heavy\" for its size.Specs:* Intel i5-8250U (8th gen i5 with 4c/8t @ 15watt TDP)* Intel UHD Graphics 620 (integrated graphics, no dedicated GPU)* 8GB DDR4 2400mhz RAM (I think 1x8GB, will have to verify)* 256GB SATA SSD (Samsung PM871 from what I can tell, seems to be 2.5\" 7mm not m.2)* 13\" 1920x1080 IPS touchscreen (glossy, but not terrible)* Webcam supports Windows HelloPorts:2x USB 3.1 type-A1x USB 2.0 type-A1x HDMI (listed as 1.4)1x SD card reader1x Headphone/mic combo jackThe monitor has, in my opinion, pretty large bezels. At first I was disappointed by this but considering its ability to take a tablet form, this likely was done to give something to hold onto in tablet mode without touching the screen by accident. Otherwise its sharp and bright with decent viewing angles.The rear of the base has a short, somewhat wide vent to exhaust hot air out and does have an active fan however at its loudest it was negligible. I would have to focus on trying to hear it to notice. The upside is it should allow longer boost times on the CPU before throttling sets in.I found it a bit strange at first that the power and volume rocker are on the right side towards the front of the machine, but have since gotten used to it and figure it is also likely purposeful due to being able to use it like a tablet.The hinge between the base and monitor is sturdy and feels like it should last if treated well. I dont notice any wobbling while typing on a hard flat surface. The keyboard is ok but not great. I like the look of it and the backlighting can be plenty bright but the feel leaves a bit to be desired. The key presses seem to allow for pressure un-evenly on a key allowing one side to press further than the others which gives the sense that its not that sturdy. I would expect for the press to evenly push the key down but on this keyboard its a bit \"mushy\". For what its worth it appears to be the exact same keyboard as the Inspiron 13\" 7000 series. On the flip side, the touch pad is pretty nice and I typically hate touchpads. This one is pretty large and the buttons (bottom right and left of the touchpad itself) are clicky.It doesnt look like there are any bay doors on the bottom to access the SSD or RAM and the batter is a built in job, not easily replaceable (if at all). It is unclear if the laptop has the 8GB included soldered in or in 1 of 2 ram slots. Its also unclear, but I expect that there is an empty 2nd ram slot (as most documentation seems to indicate it can be upgraded to 16GB by the user, just not how). I would imagine this would require removing the 8 or so screws on the bottom and maybe even using a pry tool to unsnap some plastic fasteners are the edges.For the price I was unable to find a laptop with everything I was looking to compete with this. I wanted a 13\" or smaller 1080 touchscreen with an 8th gen CPU, 250GB+ SSD, 8GB+ DDR4 RAM. This was the best deal I could find at the time including that ($709). There are tradeoffs with that. Some of what you dont get are:* USB type-c* Thunderbolt 3* NVMe PCIe SSD* Metal body* Higher resolution screenI would say this is a great machine for anyone who wants something small and portable with decent specs and that doesnt require a ton of storage or super demanding tasks (CAD, 3d rendering, advanced photoshop, extrmely large databases/spreadsheets, etc.) or gaming.Linux:I am now using Linux at work alot and learn best by giving myself a practical purpose to do something. I wanted to entrench myself in Linux at home while having something that was modern, aesthetically pleasing, functional, practical and portable.Prior to getting this laptop I tried about about 10+ distros and decided that; a) I liked KDE Plasma as a desktop environment best and b) I like Manjaro Linux as a distro the most.I didnt get this to do development type work from or anything like that. This is meant to be my \"daily driver\", its what I will use every day to browse the web, check email, work on documents, watch media, do some minor photo/video editing, occasionally run a VM, etc.I downloaded the 17.0.6 Manjaro KDE ISO and setup an USB3 drive to install from. Booted from the drive and ran installer which took about 5-10 mins which is on par or maybe slightly faster than I would expect for a Win 10 install using the same hardware/specs.Out of the box all of the drivers where recognized and working. Here are a couple things I was worried about and can confirm all working:* Qualcomm AC Wifi (will add model later, not handy right now).* Qualcomm Bluetooth* Touchscreen* Keyboard Backlight* Webcam (both standard and infrared lol)* GPU drivers for Intel* Screen Brightness* SoundI have not yet found any part of the hardware not working as intended.Battery life appears to land me at about 6+ hours of steady use so I am very happy with it.Software wise, most things just work. I have had to, as with any linux distro, troubleshoot and work out some kinks but nothing I can even recall as worth mentioning.At the end of the day, this is the first time I have felt like I really own the computer. KDE especially allows a level of customization I could only dream of in Windows. This is coming from someone who not only likes Windows 10, but previously worked for a company for 6 years with MS partnership in which we provided remote and on site support for many of their products including Windows and Office. I've developed professional course material and classes on Windows and taught the classes. I have defended Windows 10 fiercely at times. I have Windows Server 2016 Essentials at home and 3 other Windows 10 Pro computers on the domain with it.Why say all this about Windows? If someone like me can escape MS's strangle hold so can you. If you have considered moving to Linux this laptop is a great choice. However, dont take my word for it. Do your research, decide what distro and make sure it will work with whatever you install it on.EDIT (11/20/2017): So it appears the RAM and SSD can be upgraded. To do so requires removing the bottom of the laptop (roughly 8-10 screws and using a pry tool to unhinge the plastic tabs). Crucial shows upto 32GB (2x 16GB) RAM and guarantees compatibility. The SSD is a 2.5\" SATA SSD 7mm height, so m.2 drives will NOT work and especially not PCIe/NVMe drives. I havent upgraded myself as I have no need to now.EDIT (01/02/2018): For anyone concerned with firmware/BIOS updates while using Linux I have done a Intel ME Firmware update and a BIOS update (1.3.2).For the Intel SA-00086 advisory and update Dell has a page listing all model affected with links to their updates (a link to it is posted on Intel's official page for the advisory). In this case I used a Windows to Go drive to boot to Windows 10 without altering the installed setup on my machine. I had to install drivers to Intels ME and reboot. I then ran the update from Windows to Go and then shutdown and booted back to Manjaro KDE to verify the results via the script Intel provides and it returned that the issue was patched. Be aware booting from Windows to Go wouldnt be needed if running Windows already.The BIOS is actually easier. You just put the BIOS update exe on a thumb drive and plug it in, boot and press F12 to get the boot menu, select BIOS update. Browse to the update file on the thumb drive and run the update. I havent seen any other firmware udpates related to the laptop but if there are others I will likely use a Windows to go drive to do so unless its specifically a BIOS update.**Upgraded machine!!!I have since purchase changed the wifi card and upgraded the RAM. I did this as the QCA6174 wifi card made by Qualcomm isnt exactly Linux friendly. It worked, but had 2 major issues. Slow SMB xfer and it would report wifi connecting at 6 MiB/s (incorrectly). I bought an Intel 8265 which is officially supported for use in Linux brand new for $20 and works perfectly.I figured while I had it open to add another stick of RAM so I bought an 8GB stick of crucial RAM Crucial 8GB Single DDR4 2400 MT/s (PC4-19200) DR x8 Unbuffered SODIMM 260-Pin Memory - CT8G4SFD824A and it worked perfectly. To be honest the RAM upgrade wasnt even needed, but didnt want to break it open just to change the wifi card out. I considered an SSD upgrade as well, but I have like 200GB free of the 256GB so I am not exactly hurting for space.Also using this bluetooth mouse Logitech MX Anywhere 2 Wireless Mobile Mouse, Long Range Wireless Mouse with Hyper Scroll and Easy-Switch up to 3 Devices - Navy which plays very nicely connected via bluetooth. Latest stable Manjaro update even adds its battery status to the battery notification area! Really like this mouse.Would still highly recommend this laptop as I am sure it will serve me for years to come.",
        "I like the laptop. Light wt, touch screen is excellent with good resolution, super quiet, SDD is amazing ( first time owning one). Fast enough with me running photoshop 2017. Overall good laptopCONS :- plastic build, could have been more sturdy- camera is ok ok. although tbh, no one really uses it these days- fan vent is located facing down, cant keep on the bed or on lap.",
        "I bought this laptop in December'17. My laptop started having issues a very few months after purchase (its still in warranty for quite some time). The laptop kept powering off and then not starting back-on (or no display) despite several tries and showed random behavior (i had to reset the OS too, losing all my data). Ultimately there came a time when the laptop shut off with no LEDs turning on and the laptop would not power-on no matter what. I had to FedEX ship my product to their Houston site after making a long customer delivery call. I got back my laptop in a week (with the motherboard replaced). However, ever since, it has battery issues (ie. the battery drops from 50%+ to 6% within a minute) making it impossible to work with the laptop unless connected to a power source. I have never seen a Dell laptop to have misbehaved so much, it really hinders all your work.",
        "Light, feels sturdy. great screen. Has been a wonderful laptop so far. I spent a little more to get the solid state drive instead of a traditional disk. Less storage, but as one reviewer pointed out much lighter.",
        "Love this fast light weight computer. I use Corel draw on it and heavy duty embroidery software. Fast and easy",
        "This computer has been fairly easy to get up and running. I am replacing a very similar computer. For my purposes the 8MB of ram and 256 SSD are what I need now and should be sufficient for years of use.The touch screen works well. Here is my only complaint and I would say it qualifies as a design flaw. The speakers are underneath the computer, right where it would rest on your knees. So when you are using it as a laptop, the speakers are blocked and when you are using it as a tablet, they are blocked. Crazy! The last Dell Inspiron I had, the speakers were on top by the keyboard and it was a noticeably excellent sound system, so this is a bit of a disappointment, but won't keep me from using this for my real needs, only my wants.",
        "I'll be honest in saying I'm pleasantly surprised. I didn't expect to love this laptop as much as I did. After my tablet finally died I wanted something more versatile, and was thinking detachable keyboards would be the way to go. Saw this for the right price and decided to give it a shot. I'll never buy a 2-in-1 that can't swivel, ever. Can rotate it to any angle, adapts right away to tablet mode. It's a solid little powerhouse that can get a bit hot, but that's expected. Low storage isn't a huge issue. You can keep most things on another homegroup computer and keep the essentials local. Overall, great laptop for the price",
        "I bought this to replace a Dell XPS 13 that died suddenly.  While it doesn't have the fancy aluminum case, thin bezel and carbon fiber hand rest of the XPS, this Inspiron has a newer 8th generation processor, twice the SSD space, a touch screen and nice form flexibility.  I got it all set up and have found that it has a good looking screen, reasonably fast performance for a laptop and I like the ability to use it as a laptop or as a tablet.The performance and strong features for a price point of just $650, make this a very attractive choice if you are looking for a laptop of this size."
    ]
}