{
    "name": "Ideal Beach Resort",
    "url": "https://www.tripadvisor.in/Hotel_Review-g1162480-d621769-Reviews-Ideal_Beach_Resort-Mahabalipuram_Kanchipuram_District_Tamil_Nadu.html",
    "image": "https://media-cdn.tripadvisor.com/media/photo-s/10/9f/38/c6/ideal-beach-resort.jpg",
    "priceRange": "Rs 4,658 - Rs 13,699 (Based on Average Rates for a Standard Room)",
    "aggregateRating": {
        "ratingValue": "4.0",
        "reviewCount": "992"
    },
    "address": {
        "Street": "Devaneri Village , Kovalam Road",
        "Locality": "Mahabalipuram",
        "Region": "Tamil Nadu",
        "Zip": "603104",
        "Country": "India"
    },
    "reviews": [
        "Spacious room. Very neat and clean beach next to resort. Best place to hangout with family. Away from city but attractions of mahabalipuram are very near. Enjoyed the stay with my family and friends..",
        "Well located property, 3 KM away from Mahabalipuram city entrance. Located on beach and hotel has its own section of beach. Due to weekend hotel was running on full occupancy, yet it was not looking that crowded, however in afternoon there are few day tour...",
        "Had been there for a one day outing. Nice and well maintained property. Friendly staff. Ideal for a beach side vacation. Good beach sport activities around too. They have a swimming pool with 9ft depth, which is fit for diving too.. Overall good experience.",
        "Vkumarnair, Greetings from Ideal Beach Resort! We thank you for choosing Ideal Beach Resort as your holiday destination! We thank you for sharing your thoughts regarding your recent stay with us. To begin, we are thrilled that you had a good stay with us. Our...",
        "I am very happy with my stay. The staff were very courteous and polite. They were always on toes willing to satisfy any request. Rooms were extraordinary. Well lit and decor was superb. Breakfast was a good spread. It had all the choices of International...",
        "Nice, comfy cottages amidst greenery having access to private clean beach. We were nicely welcomed at reception with welcome drink and fresh flower garlands. It entire resort is serene and picturesque. Rooms have basic setup with no frills. I liked the ambience of resort and..."
    ]
}