{
    "name": "WelcomHotel Kences Palm Beach",
    "url": "https://www.tripadvisor.in/Hotel_Review-g1162480-d12081701-Reviews-WelcomHotel_Kences_Palm_Beach-Mahabalipuram_Kanchipuram_District_Tamil_Nadu.html",
    "image": "https://media-cdn.tripadvisor.com/media/photo-s/0e/72/ae/3f/photo1jpg.jpg",
    "priceRange": "Rs 5,822 - Rs 17,192 (Based on Average Rates for a Standard Room)",
    "aggregateRating": {
        "ratingValue": "4.5",
        "reviewCount": "341"
    },
    "address": {
        "Street": "No. 53, Devaneri Village, East Coast Road Devaneri Village",
        "Locality": "Mahabalipuram",
        "Region": "Tamil Nadu",
        "Zip": "603104",
        "Country": "India"
    },
    "reviews": [
        "We stayed along with our extended family here. The resort is large with a great pool for adults and kids, clean private beach that is easily reachable in minutes, a lovely spa and a brilliant restaurant that offer Breakfast buffet & Dinner buffet. The pluses...",
        "Best place to visit and stay with family, good ambiance, spacious bunglow, good food, close to beach and nature, great services, very good staff (specially Bhaskar). Would like to stay once again. Vivek",
        "We don't usually write reviews on hotels but we had such a pleasant stay at Welcomhotel Kences that we shall do so this time. The hotel is fairly new and the accomodation, fixtures and common areas are modern, clean, tasteful and well thought out. We...",
        "Beautiful beach side resort. Very patient and courteous staff. The beach is right next to the pool. They got an amazing in house restaurant. The chettinad chicken and malabar parathas were amazing. Everyone kept having them. Overall beautiful place. Lots of different kinds of birds...",
        "We have visited this resort quite a few times over the past 6 months and have found the quality of rooms, food and beverages and customer service to be consistent and of the highest level. The team at the restaurant go out of the way..."
    ]
}